In [4]:
import pandas as pd

studentDataFrame = pd.read_csv("../Creating_DataFrame/sample_two.csv")
studentDataFrame

          name                                               tech
0  Beni samuel  Full Stack | Mobile Developer | Data Scientist...
1      Laurent                  Mobile Developer | Web Developer
2         Wigo             FullStack Web Developer | OS Explorer
3     Cristian                                  Software Engineer

In [6]:
studentDataFrame["tech"] # working with the single column of the serie

0    Full Stack | Mobile Developer | Data Scientist...
1                    Mobile Developer | Web Developer
2               FullStack Web Developer | OS Explorer
3                                    Software Engineer
Name: tech, dtype: object

In [8]:
studentDataFrame["name"].max() #finding the maximum in the name column

'Wigo'

In [10]:
studentDataFrame["tech"].max()

'Software Engineer'

In [12]:
studentDataFrame.describe

<bound method NDFrame.describe of           name                                               tech
0  Beni samuel  Full Stack | Mobile Developer | Data Scientist...
1      Laurent                  Mobile Developer | Web Developer
2         Wigo             FullStack Web Developer | OS Explorer
3     Cristian                                  Software Engineer>

In [14]:
studentDataFrame.describe()

               name                                               tech
count             4                                                  4
unique            4                                                  4
top     Beni samuel  Full Stack | Mobile Developer | Data Scientist...
freq              1                                                  1